#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/naga-paritala/terraform-samples/runs/run-DXdXZnwB5a4VBtDW

Waiting for the plan to start...

Terraform v0.14.0
Configuring remote state backend...
Initializing Terraform configuration...
module.vpc.aws_vpc.main_vpc: Refreshing state... [id=vpc-0b9c704b072821c0f]
module.vpc.aws_internet_gateway.main_internet_gateway: Refreshing state... [id=igw-02b78e9ca69747030]
module.vpc.aws_subnet.private_db: Refreshing state... [id=subnet-0e80ccc9b80f99b91]
module.vpc.aws_eip.nat_db: Refreshing state... [id=eipalloc-068bcd43c2ef67e57]
module.vpc.aws_subnet.public_fe: Refreshing state... [id=subnet-0b33e5a89aa059f4d]
module.vpc.aws_eip.nat_be: Refreshing state... [id=eipalloc-0f2d9c715755495ff]
module.vpc.aws_subnet.private_be: Refreshing state... [id=subnet-095f8c8db3cdff2a2]
module.vpc.aws_nat_gateway.nat_gw_be: Refreshing state... [id=nat-02413058a04337bf3]
module.vpc.aws_nat_gateway.nat_gw_db: Refreshing state... [id=nat-0ea09977231678cb2]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.iam.aws_iam_role.eks_role will be created
  + resource "aws_iam_role" "eks_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "eks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = "eks-cluster-role"
      + path                  = "/"
      + unique_id             = (known after apply)
    }

  # module.iam.aws_iam_role_policy_attachment.eks_role-AmazonEKSClusterPolicy will be created
  + resource "aws_iam_role_policy_attachment" "eks_role-AmazonEKSClusterPolicy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"
      + role       = "eks-cluster-role"
    }

  # module.iam.aws_iam_role_policy_attachment.eks_role-AmazonEKSVPCResourceController will be created
  + resource "aws_iam_role_policy_attachment" "eks_role-AmazonEKSVPCResourceController" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSVPCResourceController"
      + role       = "eks-cluster-role"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + eks_role_arn = (known after apply)
```
</details>
*Pusher: @malliparitala, Action: `pull_request`*